InScentTiveWeb/app/Models/Cart_model.php

    public function getCartInfo(): array
    {
        return $this->findAll(); // Retrieve all cart items
---
SELECT *
FROM `cart`

    public function getCartItemById(int $id): ?array
    {
        return $this->find($id); // Retrieve a cart item by ID
---
SELECT *
FROM `cart`
WHERE `cart`.`id` = 2

    public function insertCartItem(array $data): bool
    {
        return $this->insert($data); // Insert a new cart item
---
INSERT INTO `cart` (`scent_id`, `user_id`, `quantity`) VALUES ('2', '21', '1')

    public function deleteCartItem(int $id): bool
    {
        return $this->delete($id); // Delete a cart item by ID
---
DELETE FROM `cart`
WHERE `id` IN (4)