InScentTiveWeb/app/Models/Scent_model.php

    public function getScentInfo(): array
    {
        return $this->findAll(); // Retrieve all scent records
---
SELECT *
FROM `scent`

    public function getScentById(int $id): ?array
    {
        return $this->find($id); // Retrieve a scent record by ID
---
SELECT *
FROM `scent`
WHERE `scent`.`id` = 2

    public function updateScentRecord(int $id, array $data): bool
    {
        return $this->update($id, $data); // Update a scent record by ID
---
UPDATE `scent` SET `name` = 'asdfasdsdafasdf234432', `qty` = 7, `price` = '99.99', `description` = ''
WHERE `scent`.`id` IN (2)