InScentTiveWeb/app/Models/User_model.php

    public function getUserInfo()
    {
        return $this->findAll(); // Retrieve all user records
---
SELECT *
FROM `user`

    public function getUserInfoByEmail($email)
    {
        return $this->where('email', $email)->first(); // Retrieve a user record by email
---
SELECT *
FROM `user`
WHERE `email` = 'test@email.com'
 LIMIT 1