InScentTiveWeb/app/Models/User_model.php

SELECT `userID`, `nickName`, `fullName`, `email`, `password`
FROM `user`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
---
    public function getUserInfoByEmail($email)
    {
        return $this->select('userID, nickName, fullName, email, password')->where('email', $email)->first();